## 36 pandas缺失值/空值处理
### dropna 用于删除有空数据的行或者列
#### 参数 axis=0, how='any', thresh=None, subset=None, inplace=False

### 创建数据

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

### 生成的数据

In [16]:
df

Empty DataFrame
Columns: [name, toy, born]
Index: []

In [15]:
df.dropna(axis=0,how='any',thresh=3,subset=['name','toy'],inplace=True) # 删除条件参数 thresh ：保留至少有两个非空元素的行 ,限制 name toy 两列。
# thresh 可以自行调整. inplace : 不返回副本，在原df修改

In [13]:
df.dropna(axis=0,how='any',thresh=3,subset=['name','toy']) # 删除条件参数 thresh ：保留至少有两个非空元素的行 ,限制 name toy 两列。
# thresh 可以自行调整

Empty DataFrame
Columns: [name, toy, born]
Index: []

In [10]:
df.dropna(axis=0,how='any',thresh=2) # 删除条件参数 thresh ：保留至少有两个非空元素的行

       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [9]:
df.dropna(axis=0,how='any',thresh=1) # 删除条件参数 thresh ：保留至少有一个非空元素的行

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [7]:
df.dropna(axis=0,how='any') # 删除条件参数how：行存在元素是空才删除用any

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [6]:
df.dropna(axis=0,how='all') # 删除条件参数how：行所有元素是空才删除用all

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [5]:
df.dropna(axis=1) # 删除列

       name
0    Alfred
1    Batman
2  Catwoman

In [4]:
df.dropna() # 默认会把有空值的行删掉，注意 这里是副本

     name        toy       born
1  Batman  Batmobile 1940-04-25